<template>
  <div class="func-container">
    <ElContainer>
      <ElHeader>版本管理</ElHeader>
      <ElMain style="--el-main-padding: 0px">
        <el-card class="box-card">
          <ElScrollbar style="height: 700px;">
            <ElRow>
              <ElCol :span="6">
                这是我上高中那一年。
                是名为凉宫春日的人型异常气象在北高开始肆虐那一年，也是我人生中最波澜壮阔的一年，光是回想发生了什么事就觉得烦闷的灾难年。翻开记忆相簿，五花八门、让我目瞪口呆的过往比比皆是。烙印在脑海里的，其实还有这么一小段插曲，现在我就说给大家听吧。
                那是夏天余热犹存的脚步还赖在列岛上空迟迟不走．热到让人怀疑是不是有人误触了操控四季变化的气象兵器，明明日历上已是秋高气爽的季节。
                那天，是校庆当天。
                那名脑子一整年都处于失控状况的导演兼监制，从发出电影开拍宣言到所有作业完成，期间彻底发挥了让演员和杂役的混乱定位更加混乱的特殊效果．丢三落四、有如鬼打墙一般状况不断，全拜我所赐这部电影才总算收了尾，
                今天是校庆头一天．也是电影首映日。这部片名为“朝比奈实玖琉的冒险EPisode00”不知该归类为电影或是朝比奈学姊的个人宣传带──目前应该在视听教室好评热映中。
                为何说是“应该”?当然是因为我实在不想再看到自己的名字，出现在那部挑战超现实主义到极点的大烂片中。我将DV带交给电影研究社的人后。就决定做个社外人士逍遥自在去。
                所幸，一旦牵扯上细节的交涉或是跟宣传有关的外交活动，春日充沛的活力就比平常更加旺盛，总是以团长之姿身先士卒。
                对春日的异常行为也差不多习惯了的北高师生就算了．也不想想这一天会有闲闲无事来参观的众多家长和一般校外人士在校园内走动。她小姐居然换上春初亮相过的兔女郎装发传单!不过也拜此所赐，不同于我和春日隶属的一年五班那么死气沉沉，尽义务参与活动的朝比奈学姊、长门和古泉才能一大早就各自忙着班上的校庆企画．算得上是可喜可贺，
                所以我现在的心情可好比晴空万里，心境更犹如映照出澄澈水面的明镜一般。电影的数位剪辑作业一结束。我就无事一身轻，功德圆满了，我晃晃睡眼不址不甚清醒的脑袋，打算去看看长门占卜，顺便奚落一下古泉的舞台剧演出。虽说是二流县立学校没啥新意的校庆，但是庆典就是庆典，体验一下和平日不同的气氛也是不错：
                况且今天我身负着绝对不容错过的使命．那份使命也已化为一张薄薄的纸条握在于中。
                想当然尔．那张纸条就是朝比奈学姊她们班开的炒面饮料摊的优待券。
                再廉价的茶叶经由学姊的玉手一泡，就会立刻化为天上甘泉。相信由同一双手所端出的炒面，和高级中华料理店大厨做的珍馑也相去不远。让我的肚子咕噜咕噜叫的期待值在脑内不断攀升，上校舍楼梯的步伐也轻盈得像是穿了长翅膀的鞋子。
                就在我穿过阶梯，整个人兴奋得像是快登上天堂之际，同行的人冷不防浇了我一头温水。
                “要送就送免费招待券，岂不是更好?”
                全天下说得出这么惹人嫌的话的．除了谷口以外绝对没别人了。要不是看在他协助我们拍外景时不慎落入池中的情份上，加上机会难得，否则我才懒得邀他哩.他还想奢求什么?
                “我可是挺你挺到落水．片酬还分文未取喔!你起码也该招待我去看一下试映吧。该不会我的戏令被你剪掉了?落汤鸡的代价只有区区一张炒面七折券．未免太划不来了。”
                你少鸡蛋里挑骨头，这可是朝比余学姊好心招待我们去她们班尝鲜的优待券耶!况且，拍那部电影最划不来的无酬演员非朝比余学姊莫属。我甚至想跟金像奖的评审委员打个商量。要他们颁发一尊奥斯卡小金人给学姊。
                “不爽去就别去．快滚!”
                听我那么一说，另．位同行的人连忙打圆场。
                “好了、好了。谷口，一起去啦。反正你本来就打算边吃边逛啊，独逛逛不如众吃吃，走啦。”
                这侗人就是我的同班同学，有着和古泉截然不同的优等生面貌的国木田。
                “而且和阿虚一起去，搞不好会得到更多优惠喔。像是多一点高丽菜。你不也很喜欢吃高丽菜吗?谷口。”
                “还好啦．”
                谷口爽快地回应。
                “那也要看味道而定啊。阿虚，朝比奈学姊不下厨的吧?”
                这么一问，我才想起学姊好像说过她是负责上菜端茶水的。那又怎样?
                “没有啦，我只是直觉学姊的厨艺菜得很。就算她将砂糖误当成盐巴下去调味，我都不觉得奇怪。”
                不是我爱念，你和春日到底把朝比奈学姊当成什么了?纵使她是再称职的吉祥物兼俏女侍，在这个时代还会误将砂糖当成盐巴的小迷糊只有幻想世界才找得到。学姊顶多只会弄丢时光机器，急得手足无措而已。虽然光这一点就很难想像她是未来人．
                “真期待。”国木田说：“听说她们班开的是Cosplay咖啡厅．不管是电影里的女服务生打扮，或是那天的兔女郎扮相都叫人惊艳，不知道这次学姊会做什么样的打扮?”
                “超期待的。”
                谷口也深表赞同。这两人毕竟不像我看惯了朝比奈学姊的女侍装扮。对此，我深表怜悯．
                从阶梯步上走廊，我也开始在心中描绘了起来。说到女服务生，我那坏去的头壳就想到学姊在电影里穿的那套让人忍不住想伸出咸猪手的紧身制服。今天总算有机会见到穿着端庄，楚楚动人地端着炒面过来的朝比奈学姊，还有什么比这更能洗涤视网膜和心灵的呢。我从以前就认为春日喜欢的设计风格太繁复．毕竟那女人的神经可是硬到敢扮成兔女郎站在校门口。那样刚硬的神经配她那样的粗人或许刚刚好，但不见得人人都有如钢丝一般的神经。
                朝比奈学姊班上大家共同制作的女服务生手工制服……
                唯有在这件事上，我能与谷口异口同声：真期待、超期待的!
                今天的校舍走廊铺上厂与廉价红地毯无异的绿色草坪．平日进校舍都强迫要换上室内鞋，因为顾及到外来一般客的方便，只有举行校庆的今明两天可以直接穿鞋子进来．在校内行走的人影也变得多彩多姿。特别是有发表会的艺文社团社员，其学生的监护人几乎都来了，校园顿时成了附近居民打发时间的场所。也有不少学生招待高中不同校的国中时代的朋友来参观校庆。尤其是山下的女校学生．这可是一年一度诱饵进洞的机会，渴望来个浪漫邂逅的不只有谷口之流。
                在北高制服除外的身影都很引人注目的走廊上，我们三人像是被诱饵吸引而来的沙丁鱼，在整排都是二年级教室的校舍一角回游，最后在打地鼠游乐场和创作汽球工作室中间的教室前面落脚。
                飘出铁板烧焦的阵阵香气的入口前面，立有写着“橡果炒面饮料摊”的招牌．那间教室的人龙排得比每间教室都来得长。不，在长长的人龙映入眼帘前．我的耳朵就先听到：
                “呀!阿虚和阿虚的朋友来了!这边、这边，欢迎光临!”
                那是即使离了十公尺远，我也绝不会听错的爽朗女声，不会认错的灿烂笑脸。能笑得如此开怀的人，除了惹祸精春日之外，我就只认识一个．
                “谢谢三位光临小店。承蒙关照了!”
                那人正是鹤屋学姊．而且是做女服务生打扮。
              </ElCol>
            </ElRow>
            <!-- 间隔 -->
            <el-row>
              <el-col :span="24">
                <el-col :span="24" :style="{ height: '20px' }"></el-col>
              </el-col>
            </el-row>
            <ElRow>
              <ElCol :span="2">
                <ElButton>
                  升级
                </ElButton>
              </ElCol>
              <ElCol :span="2">
                <ElButton>
                  清除存储
                </ElButton>
              </ElCol>
            </ElRow>
          </ElScrollbar>
        </el-card>
      </ElMain>
    </ElContainer>
  </div>
</template>

<script setup>
import { ElScrollbar } from "element-plus";
import { ref } from "vue";
import { useRouter } from "vue-router";
const router = useRouter();
</script>

<style scoped src="../styles/dispbox.css"></style>